tutorials/shockTube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0.5 0.25 -0.5)
    (-0.5 0.25 -0.5)
    (-0.5 -0.25 -0.5)
    (0.5 -0.25 -0.5)
    (0.5 0.25 0.5)
    (-0.5 0.25 0.5)
    (-0.5 -0.25 0.5)
    (0.5 -0.25 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (500 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    side1
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    side2
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    wall
//     empty
    {
        type patch;
//         type empty;
        faces
        (
            (0 1 5 4)
            (5 6 7 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
);

// ************************************************************************* //
