tutorials/shockTube/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|                                                                             |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convectiveFluxScheme
{
    fluxScheme        ROE;
    entropyFixCoeff	0.05;
}

viscousFluxScheme
{
   LaxFriedrichJacobian  true;
}

ddtSchemes
{
    default         dualTime rPseudoDeltaT backward; 
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
}

laplacianSchemes
{
}

interpolationSchemes
{
    default         linear;

    reconstruct(rho) vanLeer;
    reconstruct(U)  vanLeer;
    reconstruct(T)  vanLeer;
}

snGradSchemes
{
}


// ************************************************************************* //
